Revit 2027 API
CurveLoop.CreateViaCopy Method
 Creates a new curve loop as a copy of the input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static CurveLoop CreateViaCopy(
	CurveLoop original
)
Public Shared Function CreateViaCopy (
	original As CurveLoop
) As CurveLoop
public:
static CurveLoop^ CreateViaCopy(
	CurveLoop^ original
)
static member CreateViaCopy :
        original : CurveLoop -> CurveLoop
Parameters
original CurveLoop
 The original curve loop.
Return Value
CurveLoop
 The copied curve loop.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace